src/Reports/РегламентированныйОтчетФорма5/РегламентированныйОтчетФорма5.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегламентированныйОтчетФорма5</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЕдиницыИзмерения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет/НачислениеАмортизацииОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НачислениеАмортизацииОСБухгалтерскийУчет</name>
  <comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СчетаБухгалтерскогоУчетаОС/СчетаБухгалтерскогоУчетаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаБухгалтерскогоУчетаОС</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет/ПервоначальныеСведенияОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияОСБухгалтерскийУчет</name>
  <comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДополнительный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/ПервоначальныеСведенияНМАБухгалтерскийУчет/ПервоначальныеСведенияНМАБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияНМАБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииНМА</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СчетаБухгалтерскогоУчетаНМА/СчетаБухгалтерскогоУчетаНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаБухгалтерскогоУчетаНМА</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/РегламентированныйОтчетФорма5/ObjectModule.bsl
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит структуру многостраничных разделов
Перем мСтруктураМногостраничныхРазделов Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ РегламентированныйОтчет,
// хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки показа страниц, вывода на печать и выгрузки в ИМНС.
//  требуется редакция по наименованиям ПолейТабличныхДокументов
//функция возвращает таблицу с данными для ОС для заполнения примечаний к финансовой отчетности (формы № 5)
Функция СформироватьЗапросДляОС(НачалоПериода,КонецПериода,Организация) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода" ,КонецПериода);
	СтруктураПараметров.Вставить("Организация"  , Организация);
	
	Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""СписокОС"" КАК ТипЗаписи,
	|	НачислениеАмортизации.ОсновноеСредство КАК Поле
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК НачислениеАмортизации
	|ГДЕ
	|	НачислениеАмортизации.НачислятьАмортизацию
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	""СписокОС"" КАК ТипЗаписи,
	|	НачислениеАмортизации.ОсновноеСредство КАК Поле
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизации
	|ГДЕ
	|	НачислениеАмортизации.НачислятьАмортизацию
	|	И НачислениеАмортизации.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НачислениеАмортизации.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчета"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизации"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчета"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчета
	|ГДЕ
	|	СчетаБухгалтерскогоУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетаБухгалтерскогоУчета.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизации"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчета
	|ГДЕ
	|	СчетаБухгалтерскогоУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетаБухгалтерскогоУчета.Организация = &Организация
	|
	|ИТОГИ ПО
	|	ТипЗаписи";
	
	ДеревоРезультатов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПараметров.Вставить("СписокОС"                      , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчета"                    , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизации"              , Неопределено);
	
	Для каждого СтрокаТипаЗаписи Из ДеревоРезультатов.Строки Цикл
	
		СтруктураПараметров.Вставить(СтрокаТипаЗаписи.ТипЗаписи, 
		                             СтрокаТипаЗаписи.Строки.ВыгрузитьКолонку("Поле"));	
	
	КонецЦикла;
								 
		Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведения.ОсновноеСредство                                       КАК ОсновноеСредство,
	|	СчетаБухгалтерскогоУчета.СчетУчета                                            КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации                            КАК СчетНачисленияАмортизации,
	|	ЕСТЬNULL(СтоимостьОстатки.СуммаОстатокДт, 0)                                  КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(АмортизацияОстаткиНач.СуммаОстатокКт, 0)                             КАК АмортизацияНачальныйОстаток,
    |	ЕСТЬNULL(НачисленнаяАмортизация.СуммаОборот, 0)                               КАК АмортизацияОборот,
	|	ЕСТЬNULL(ИзменениеСтоимостиПлюс.СуммаОборот, 0)                               КАК ИзменениеСтоимостиДт,
	|	ЕСТЬNULL(СписаннаяАмортизация.СуммаОборот, 0)                                 КАК АмортизацияОборотДт,
	|	ЕСТЬNULL(ИзменениеСтоимостиМинус.СуммаОборот, 0)                              КАК ИзменениеСтоимостиКт,
    |	ЕСТЬNULL(АмортизацияОстаткиКон.СуммаОстатокКт, 0)                             КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьОстаткиКон.СуммаОстатокДт, 0)                               КАК СтоимостьКонечныйОстаток
	|
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|		            &КонецПериода,
	|		            Организация = &Организация
	|		            И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаУчета),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокОС)) КАК СтоимостьОстатки
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СтоимостьОстатки.Субконто1
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &КонецПериода,
	|		                       Счет В (&СчетаУчета),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокОС)) КАК СтоимостьОстаткиКон
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СтоимостьОстаткиКон.Субконто1
    |
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаАмортизации),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокОС)) КАК АмортизацияОстаткиНач
	|		ПО ПервоначальныеСведения.ОсновноеСредство = АмортизацияОстаткиНач.Субконто1
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (СчетДт В (&СчетаУчета)),&СубконтоОС,
	|		                       Не СчетКт В (&СчетаУчета),  ,
	|		                       Организация = &Организация
	|		                       И СубконтоДт1 В (&СписокОС)
	|		                       ) КАК ИзменениеСтоимостиПлюс
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ИзменениеСтоимостиПлюс.СубконтоДт1
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (НЕ СчетДт В (&СчетаАмортизации)), ,
	|		                       СчетКт В (&СчетаАмортизации),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (&СписокОС)
	|		                       ) КАК НачисленнаяАмортизация
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НачисленнаяАмортизация.СубконтоКт1
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (Не СчетДт В (&СчетаУчета)), ,
	|		                       СчетКт В (&СчетаУчета),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (&СписокОС)
	|		                       ) КАК ИзменениеСтоимостиМинус
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ИзменениеСтоимостиМинус.СубконтоКт1
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (СчетДт В (&СчетаАмортизации)),&СубконтоОС,
	|		                       Не СчетКт В (&СчетаАмортизации), ,
	|		                       Организация = &Организация
	|		                       И СубконтоДт1 В (&СписокОС)
	|		                       ) КАК СписаннаяАмортизация
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СписаннаяАмортизация.СубконтоДт1
    |
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &КонецПериода,
	|		                       Счет В (&СчетаАмортизации),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокОС)) КАК АмортизацияОстаткиКон
	|		ПО ПервоначальныеСведения.ОсновноеСредство = АмортизацияОстаткиКон.Субконто1
	|
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПервых(
	|		                    ,
	|		                    Организация = &Организация
	|		                    И ОсновноеСредство В (&СписокОС)) КАК СчетаБухгалтерскогоУчета
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СчетаБухгалтерскогоУчета.ОсновноеСредство";

	
	ТаблицаИзносаОС = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзносаОС;
	
КонецФункции

//функция возвращает таблицу с данными для НМА для заполнения примечаний к финансовой отчетности (формы № 5)
Функция СформироватьЗапросДляНМА(НачалоПериода,КонецПериода,Организация) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода" ,КонецПериода);
	СтруктураПараметров.Вставить("Организация"  , Организация);

	
	Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""СписокНМА""                           КАК ТипЗаписи,
	|	НачислениеАмортизации.НематериальныйАктив КАК Поле
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация)
	|		            КАК НачислениеАмортизации
	|ГДЕ
	|	НачислениеАмортизации.НачислятьАмортизацию
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчета"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация)
	|		            КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизации"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		            &НачалоПериода,
	|		            Организация = &Организация)
	|		            КАК СчетаБухгалтерскогоУчета
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	""СписокНМА""                           КАК ТипЗаписи,
	|	НачислениеАмортизации.НематериальныйАктив КАК Поле
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет
	|		            КАК НачислениеАмортизации
	|ГДЕ
	|	НачислениеАмортизации.НачислятьАмортизацию
	|	И НачислениеАмортизации.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НачислениеАмортизации.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаУчета"",
	|	СчетаБухгалтерскогоУчета.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА
	|		            КАК СчетаБухгалтерскогоУчета
	|ГДЕ
	|	СчетаБухгалтерскогоУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетаБухгалтерскогоУчета.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СчетаАмортизации"",
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаНМА
	|		            КАК СчетаБухгалтерскогоУчета
	|ГДЕ
	|	СчетаБухгалтерскогоУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетаБухгалтерскогоУчета.Организация = &Организация
	|
	|ИТОГИ ПО
	|	ТипЗаписи";
	
	ДеревоРезультатов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПараметров.Вставить("СписокНМА"                     , Неопределено);
	СтруктураПараметров.Вставить("СчетаУчета"                    , Неопределено);
	СтруктураПараметров.Вставить("СчетаАмортизации"              , Неопределено);
	
	Для каждого СтрокаТипаЗаписи Из ДеревоРезультатов.Строки Цикл
	
		СтруктураПараметров.Вставить(СтрокаТипаЗаписи.ТипЗаписи, 
		                             СтрокаТипаЗаписи.Строки.ВыгрузитьКолонку("Поле"));	
	
	КонецЦикла;
								 
	Запрос = Новый Запрос();
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
	
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);	
	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СубконтоНМА", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив                                    КАК НематериальныйАктив,
	|	СчетаБухгалтерскогоУчета.СчетУчета                                            КАК СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации                            КАК СчетНачисленияАмортизации,
	|	ЕСТЬNULL(СтоимостьОстатки.СуммаОстатокДт, 0)                                  КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(АмортизацияОстаткиНач.СуммаОстатокКт, 0)                             КАК АмортизацияНачальныйОстаток,
    |	ЕСТЬNULL(НачисленнаяАмортизация.СуммаОборот, 0)                               КАК АмортизацияОборот,
	|	ЕСТЬNULL(ИзменениеСтоимостиПлюс.СуммаОборот, 0)                               КАК ИзменениеСтоимостиДт,
	|	ЕСТЬNULL(СписаннаяАмортизация.СуммаОборот, 0)                                 КАК АмортизацияОборотДт,
	|	ЕСТЬNULL(ИзменениеСтоимостиМинус.СуммаОборот, 0)                              КАК ИзменениеСтоимостиКт,
    |	ЕСТЬNULL(АмортизацияОстаткиКон.СуммаОстатокКт, 0)                             КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьОстаткиКон.СуммаОстатокДт, 0)                               КАК СтоимостьКонечныйОстаток
	|
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|		            &КонецПериода,
	|		            Организация = &Организация
	|		            И НематериальныйАктив В (&СписокНМА)) КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаУчета),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК СтоимостьОстатки
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьОстатки.Субконто1
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &КонецПериода,
	|		                       Счет В (&СчетаУчета),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК СтоимостьОстаткиКон
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьОстаткиКон.Субконто1
    |
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &НачалоПериода,
	|		                       Счет В (&СчетаАмортизации),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК АмортизацияОстаткиНач
	|		ПО ПервоначальныеСведения.НематериальныйАктив = АмортизацияОстаткиНач.Субконто1
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (СчетДт В (&СчетаУчета)), ,
	|		                       Не СчетКт В (&СчетаУчета),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И СубконтоДт1 В (&СписокНМА)
	|		                       ) КАК ИзменениеСтоимостиПлюс
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ИзменениеСтоимостиПлюс.СубконтоДт1
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (НЕ СчетДт В (&СчетаАмортизации)), ,
	|		                       СчетКт В (&СчетаАмортизации),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (&СписокНМА)
	|		                       ) КАК НачисленнаяАмортизация
	|		ПО ПервоначальныеСведения.НематериальныйАктив = НачисленнаяАмортизация.СубконтоКт1
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (Не СчетДт В (&СчетаУчета)), ,
	|		                       СчетКт В (&СчетаУчета),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И СубконтоКт1 В (&СписокНМА)
	|		                       ) КАК ИзменениеСтоимостиМинус
	|		ПО ПервоначальныеСведения.НематериальныйАктив = ИзменениеСтоимостиМинус.СубконтоКт1
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		                       &НачалоПериода,
	|		                       &КонецПериода, ,
	|		                       (СчетДт В (&СчетаАмортизации)), ,
	|		                       Не СчетКт В (&СчетаАмортизации),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И СубконтоДт1 В (&СписокНМА)
	|		                       ) КАК СписаннаяАмортизация
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СписаннаяАмортизация.СубконтоДт1
    |
    |
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		                       &КонецПериода,
	|		                       Счет В (&СчетаАмортизации),
	|		                       &СубконтоНМА,
	|		                       Организация = &Организация
	|		                       И Субконто1 В (&СписокНМА)) КАК АмортизацияОстаткиКон
	|		ПО ПервоначальныеСведения.НематериальныйАктив = АмортизацияОстаткиКон.Субконто1
	|
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|		                    &КонецПериода,
	|		                    Организация = &Организация
	|		                    И НематериальныйАктив В (&СписокНМА)) КАК СчетаБухгалтерскогоУчета
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СчетаБухгалтерскогоУчета.НематериальныйАктив";

    ТаблицаИзносаНМА = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзносаНМА;
	
КонецФункции




////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока15  = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока254 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);


мСтруктураВариантыЗаполнения      = Новый Структура;

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2000Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом Министерства финансов Украины от 29.11.2000 года N 302 ';uk='Затверджена наказом Міністерства фінансів України від 29.11.2000 року N 302 '");
НоваяФорма.ДатаНачалоДействия = '20000101';
НоваяФорма.ДатаКонецДействия  = '20081130';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2008Кв4";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом МФУ от 29.11.2000 года N 302.(с изменениями, внесенными приказом МФУ №1238 от 14.10.2008)';uk='Затверджена наказом МФУ від 29.11.2000 року N 302.(зі змінами, внесеними наказом МФУ №1238 від 14.10.2008)'");
НоваяФорма.ДатаНачалоДействия = '20081201';
НоваяФорма.ДатаКонецДействия  = '20090930';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв4";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом МФУ от 29.11.2000 года N 302.(с изменениями, внесенными приказом МФУ №1125 от 25.09.2009)';uk='Затверджена наказом МФУ від 29.11.2000 року N 302.(зі змінами, внесеними наказом МФУ №1125 від 25.09.2009)'");
НоваяФорма.ДатаНачалоДействия = '20091001';
НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));

#КонецЕсли
